export default function ForWhomSection() {
	return (
		<section className='py-16 px-6 max-w-5xl mx-auto w-full container mx-auto'>
			<h2 className='text-3xl font-bold mb-8 text-center'>
				Кому підійде марафон?
			</h2>
			<ul className='space-y-6 text-lg'>
				<li>
					✅ Вокалістам середнього та просунутого рівня, які хочуть додати
					своєму голосу потужності, драйву та хрипотци, не втрачаючи контролю та
					безпеки.
				</li>
				<li>
					✅ Викладачам вокалу, які прагнуть глибше зрозуміти екстрим-техніки та
					навчитися ефективно передавати їх своїм учням.
				</li>
				<li>
					🚀 Якщо ти хочеш розширити можливості свого вокалу, освоїти
					контрольований драйв і зробити свій голос яскравішим, впевненішим і
					роковішим — цей марафон для тебе!
				</li>
			</ul>
		</section>
	)
}
