export default function WhatIncludedSection() {
	return (
		<section className='py-16 px-6 w-full bg-[url("../assets/bg-container.jpg")] bg-no-repeat bg-cover text-white relative'>
			<div className='absolute inset-0 bg-black/80 z-0' />
			<div className='relative z-10'>
				<h2 className='text-3xl font-bold mb-8 text-center'>
					Що входить до марафону?
				</h2>
				<ul className='max-w-4xl mx-auto space-y-6 text-lg'>
					<li>
						🎤 Глибокий розбір техніки &quot;драйв&quot; — зрозумієш, як працює
						ця екстрим-техніка, у чому її особливість та як правильно освоїти її
						без шкоди для голосу.
					</li>
					<li>
						🛠 Покрокові вправи для поступового розвитку екстрим-звучання,
						зміцнення голосового апарату та повного контролю над технікою.
					</li>
					<li>
						🎶 Практика на стилістичних рокових вправах та фрагментах з відомих
						пісень — навчимося впроваджувати драйв у спів так, щоб це звучало
						органічно та музично.
					</li>
					<li>
						📚 PDF-конспекти до кожного уроку — ключові моменти, технічні нюанси
						та корисні поради в зручному форматі.
					</li>
					<li>
						📩 Зворотний зв’язок від мене — я допоможу тобі почути свої помилки,
						скоригую техніку та підкажу, як досягти потрібного звучання.
					</li>
					<li>
						🏆 Сертифікат про проходження марафону — підтвердження твоїх нових
						навичок, яке можна додати у своє портфоліо або використовувати як
						доказ професійного розвитку.
					</li>
				</ul>
			</div>
		</section>
	)
}
